
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Очистить();
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ПериодДействияНачало;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ПериодДействияКонец;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
		Движение.График = ТекСтрокаОсновныеНачисления.График;
	КонецЦикла;

	// регистр ДопНачисления
	Движения.ДопНачисления.Очистить();
	Движения.ДопНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаДопНачисления Из ДопНачисления Цикл
		Движение = Движения.ДопНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		Движение.ВидРасчета = ТекСтрокаДопНачисления.ВидРасчета;
		Движение.БазовыйПериодНачало = ТекСтрокаДопНачисления.БазовыйПериодНачало;
		Движение.БазовыйПериодКонец = ТекСтрокаДопНачисления.БазовыйПериодКонец;
		Движение.Сотрудник = ТекСтрокаДопНачисления.Сотрудник;
		Движение.Подразделение = ТекСтрокаДопНачисления.Подразделение;
	КонецЦикла;

	Движения.Записать();
	
	Расчет.РассчитатьНачисления(Ссылка);
	
	
КонецПроцедуры
