
&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗагрузитьОтобранныеТоварыНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОтобранныеТоварыНаСервере(Адрес)
	
	Объект.СписокНоменклатуры.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборТовара(Команда)
	
	ПарамАдрес	= Новый Структура("Адрес",АдресВХранилище());
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбора",ПарамАдрес,Элементы.СписокНоменклатуры);
	
КонецПроцедуры

&НаСервере
Функция АдресВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.СписокНоменклатуры.Выгрузить(),УникальныйИдентификатор);
	
КонецФункции
