
&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Обработка выбранной в дополнительной форме номенклатуры (перенос номенклатуры и цены)
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ВыбранноеЗначение);
	РассчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Открытие дополнительной формы выбора номенклатуры, через параметры передаются Склад и Тип цены из документа
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("ТипЦены", Объект.ТипЦены);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ДопФормаВыбора", ПараметрыФормы, Элементы.СписокНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	РассчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	
	РассчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	
	РассчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму(ТД)
	
	ТД.Сумма	= ?(ЗначениеЗаполнено(ТД.Количество),ТД.Количество,0) * ?(ЗначениеЗаполнено(ТД.Цена),ТД.Цена,0);	
	
КонецПроцедуры

