
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ИмяП	= ИмяПользователя();
	ТекПользователь	= Справочники.ФизическиеЛица.НайтиПоНаименованию(ИмяП);
	Если ТекПользователь = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
		НовПользователь					= Справочники.ФизическиеЛица.СоздатьЭлемент();
		НовПользователь.Код				= ИмяП;
		НовПользователь.Наименование	= ИмяП;
		НовПользователь.Записать();
		
	    ТекПользователь					= НовПользователь.Ссылка;
	КонецЕсли;
	ПараметрыСеанса.ТекущийПользователь	= ТекПользователь;
	
КонецПроцедуры
