
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФотоСтрока	= ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Фото");	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФото(Команда)
	ОповещениеПомещенияФала		= Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
//	НачатьПомещениеФайлаНаСервер(ОповещениеПомещенияФала, , , , , УникальныйИдентификатор);
	НачатьПомещениеФайла(ОповещениеПомещенияФала, , , Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(ФайлВыбран, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если ФайлВыбран Тогда 
		ФотоСтрока	= Адрес; 
		Модифицированность	= Истина; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(ФотоСтрока) Тогда
	    ДвДанные	= ПолучитьИзВременногоХранилища(ФотоСтрока);
		ТекущийОбъект.Фото	= Новый ХранилищеЗначения(ДвДанные);
	КонецЕсли;
	
КонецПроцедуры

