
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ДВИЖЕНИЯ ПО РЕГИСТРУ ДАННЫЕ ТАБЕЛЯ
	
	Движения.ДанныеТабеля.Записывать = Истина;
	
	НачалоМесяцаТабеля = НачалоМесяца(Дата);
	
	//Обходим все дни каждой строки табличной части. Если значение заполнено и это не буква "К", 
	//то преобразовываем к числу и записываем данные по отработанным часам в регистр данных табеля.
	Для Каждого СтрокаТЧ Из СписокСотрудников Цикл		
		Для ДеньМесяца = 1 По 31 Цикл
			
			ДанныеДня = СтрокаТЧ["День" + ДеньМесяца];
			
			Если ДанныеДня <> "К" И ЗначениеЗаполнено(ДанныеДня) Тогда
				
				НоваяЗапись = Движения.ДанныеТабеля.Добавить();
				НоваяЗапись.Период = НачалоМесяцаТабеля + (ДеньМесяца - 1) * 86400;
				НоваяЗапись.Сотрудник = СтрокаТЧ.Сотрудник;
				НоваяЗапись.Подразделение = Подразделение;
				
				НоваяЗапись.ОтработаноЧасов = Число (ДанныеДня);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;		
	
КонецПроцедуры
