Функция УстановитьУчетнуюПолитику()	Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаСрезПоследних.МетодСписанияПоПартиям КАК МетодУчетаПартий
		|ИЗ
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Дата, ) КАК УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Перечисления.МетодУчета.FIFO
	Иначе	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.МетодУчетаПартий;
	КонецЕсли; 

КонецФункции // УстановитьУчетнуюПолитику()

Процедура УстановитьТекущегоИсполнителя() Экспорт
	
	Пользователь	= Справочники.Сотрудники.НайтиПоНаименованию(ИмяПользователя());
	Если Пользователь = Неопределено Тогда
		НовСотрудник	= Справочники.Сотрудники.СоздатьЭлемент();
		НовСотрудник.Наименование	= ИмяПользователя();
		НовСотрудник.Записать();
		Пользователь	= НовСотрудник.Ссылка;
	КонецЕсли; 
	
	ПараметрыСеанса.ТекущийИсполнитель	= Пользователь;

КонецПроцедуры
