
&НаСервере
Процедура СформироватьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияФактическийПериодДействия.Сотрудник КАК Сотрудник,
		|	ОсновныеНачисленияФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисленияФактическийПериодДействия.ПериодДействияНачало КАК ПериодНачало,
		|	ОсновныеНачисленияФактическийПериодДействия.ПериодДействияКонец КАК ПериодКонец
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ФактическийПериодДействия КАК ОсновныеНачисленияФактическийПериодДействия
		|ГДЕ
		|	ОсновныеНачисленияФактическийПериодДействия.ПериодДействия МЕЖДУ &ДатаН И &ДатаК
		|	И ОсновныеНачисленияФактическийПериодДействия.Активность";
	
	Запрос.УстановитьПараметр("ДатаН", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаК", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка	= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Точка			= Диаграмма.УстановитьТочку(Выборка.Сотрудник);
		Серия			= Диаграмма.УстановитьСерию(Выборка.ВидРасчета);
		Значение		= Диаграмма.ПолучитьЗначение(Точка, Серия);

		Интервал		= Значение.Добавить();
		Интервал.Начало	= НачалоДня(Выборка.ПериодНачало);		
		Интервал.Конец	= Конецдня(Выборка.ПериодКонец - 1); 
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Диаграмма.Очистить();
	СформироватьНаСервере();
КонецПроцедуры
