
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРабот.СоздатьНаборЗаписей();
	Набор.Отбор.График.Установить(График);	
	
	ЧислоСекундВСутках = 86400;
	Дат = ДатаНачала;
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.График = График;
		Запись.Дата = Дат;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.Часов = 0;		
			Запись.Дней = 0;
		Иначе	          
			Запись.Часов = 8;
			Запись.Дней = 1;			
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	
	Набор.Записать();
КонецПроцедуры
