
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для каждого Запись Из Движения.ОстаткиНоменклатуры Цикл
		Запись.Период	= Дата;	
	КонецЦикла; 	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	НаборЗаписей		= РегистрыНакопления.ОстаткиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.УстановитьАктивность(НЕ ПометкаУдаления);
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ОбъектКопирования.Движения.ОстаткиНоменклатуры.Прочитать();
	Движения.ОстаткиНоменклатуры.Загрузить(ОбъектКопирования.Движения.ОстаткиНоменклатуры.Выгрузить());
	Движения.ОстаткиНоменклатуры.УстановитьАктивность(НЕ ПометкаУдаления);
КонецПроцедуры
