
&НаСервереБезКонтекста
Процедура ЗаполнитьГрафикНаСервере(ДатаН, ДатаК, График)
    ДатаГрафика	= ДатаН;  
	ДниНедели	= 7;
	Пока ДатаГрафика<=ДатаК Цикл
		НовЗапись				= РегистрыСведений.ГрафикиРаботы.СоздатьМенеджерЗаписи();
		НовЗапись.Дата			= ДатаГрафика;
		НовЗапись.График		= График;
		Если ДниНедели < 6 Тогда
			НовЗапись.Значение	= 1;	// нам нужны дни	
		Иначе
			НовЗапись.Значение	= 0;	
		КонецЕсли;                                         
		НовЗапись.Записать();	
		
		ДниНедели				= ДниНедели + 1;
		Если ДниНедели>7 Тогда
			ДниНедели			= 1;			
		КонецЕсли; 
 		ДатаГрафика				= ДатаГрафика+(60*60*24);
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ЗаполнитьГрафикНаСервере(Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания, Объект.График);     
	Сообщение		= Новый СообщениеПользователю;
	Сообщение.Текст	= "График заполнен!";
	Сообщение.Сообщить();
КонецПроцедуры
