
&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.Сотрудники.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	РасчетыССотрудникамиОстатки.ВидРасчета КАК ВидРасчета,
		|	РасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыССотрудниками.Остатки(&Дата, Подразделение = &Подразделение) КАК РасчетыССотрудникамиОстатки";
	
	Если НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Запрос.Текст	= СтрЗаменить(Запрос.Текст, "Подразделение = &Подразделение", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
 	Запрос.УстановитьПараметр("Дата", КонецМесяца(Объект.Дата)+1);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка  = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стр	= Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(стр, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
