
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр РасчетыССотрудниками Расход
	Движения.РасчетыССотрудниками.Очистить();
	Движения.РасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.РасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.ВидРасчета = ТекСтрокаСотрудники.ВидРасчета;
		Движение.Сумма = ТекСтрокаСотрудники.Сумма;
	КонецЦикла;

КонецПроцедуры
