Функция УстановитьТекущегоСотрудника() Экспорт

	Сотрудник	= Справочники.Сотрудники.НайтиПоНаименованию(ИмяПользователя(), Истина);
	Если Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		НовСотрудник = Справочники.Сотрудники.СоздатьЭлемент();
		НовСотрудник.Наименование = ИмяПользователя();
		НовСотрудник.Записать();
		Сотрудник = НовСотрудник.Ссылка;		
	КонецЕсли; 

	Возврат Сотрудник;
КонецФункции

Процедура ФормированиеЗадач() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведеньяОСотрдникахСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.СведеньяОСотрдниках.СрезПоследних(&МоментВремени, ) КАК СведеньяОСотрдникахСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	СведеньяОСотрдникахСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("МоментВремени", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЗадача	= Задачи.ОтчетОПроделаннойРаботе.СоздатьЗадачу();
		НовЗадача.Дата	= ТекущаяДата();
		НовЗадача.Наименование	= "Отчет о проделанной работе";
		НовЗадача.Исполнитель	= ВыборкаДетальныеЗаписи.Сотрудник;
		НовЗадача.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
