
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	
	ПериодРегистрации = НачалоМесяца(Дата);
	КонецБазовогоПериода = КонецМесяца(Дата);
	
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодРегистрации = ПериодРегистрации;
		Если ТекСтрокаОсновныеНачисления.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
			Движение.БазовыйПериодНачало = ПериодРегистрации;
			Движение.БазовыйПериодКонец = КонецБазовогоПериода;
			Движение.Параметр = ТекСтрокаОсновныеНачисления.Размер; // процент премии			
		КонецЕсли;
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
		
	КонецЦикла;
	
	// Запись рабочего набора записей
	Движения.Записать();
	
	// Окончательный расчет данных в регистре
	Расчет.РассчитатьНачисления(Ссылка, Движения.ОсновныеНачисления);

КонецПроцедуры
