
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаСрезПоследних.Регистратор КАК Регистратор,
		|	УчетнаяПолитикаСрезПоследних.МетодСписанияТоваров КАК МетодСписания
		|ИЗ
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&ДатаСреза, ) КАК УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщение	= Новый СообщениеПользователю;
		Сообщение.Текст	= "Не установлен метод списания партий";
		Сообщение.Сообщить();
		Отказ	= Истина;
	КонецЕсли; 
	
	Если Отказ Тогда
	    Возврат;
	КонецЕсли; 
	
	Выборка	= РезультатЗапроса.Выбрать();
	Партия	= ?(Выборка.МетодСписания = Перечисления.МетодСписания.ПоСредней, Выборка.Регистратор, Ссылка);
	
	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыИУслуги Из ТоварыИУслуги Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТоварыИУслуги.Номенклатура;
		Движение.Партия = Партия;
		Движение.Количество = ТекСтрокаТоварыИУслуги.Количество;
		Движение.Сумма = ТекСтрокаТоварыИУслуги.Сумма;
	КонецЦикла;

КонецПроцедуры
