// пометка удаления
Процедура ПриЗаписи(Отказ)
	НаборЗаписей		= РегистрыБухгалтерии.ЖурналПроводок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.УстановитьАктивность(НЕ ПометкаУдаления);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// копирование движений
Процедура ПриКопировании(ОбъектКопирования)
	ОбъектКопирования.Движения.ЖурналПроводок.Прочитать();
	Движения.ЖурналПроводок.Загрузить(ОбъектКопирования.Движения.ЖурналПроводок.Выгрузить());
	Движения.ЖурналПроводок.УстановитьАктивность(НЕ ПометкаУдаления);
	
КонецПроцедуры
 