
&НаСервере
Процедура РассчитатьНаСервере()
	Док	= РеквизитФормыВЗначение("Объект");
	
	Если Док.ЭтоНовый() Тогда
	    Сообщение	= Новый СообщениеПользователю;
		Сообщение.Текст	= "Перед расчетом документ должен быть записан!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Док.ЗаписатьДанные(); 
	
	// ОсновныеНачисления
	НаборЗаписей	= РегистрыРасчета.ОсновныеНачисления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	
	ПараметрыОтбора	= Новый Структура("НомерСтроки",);
	
	Для каждого Запись Из НаборЗаписей Цикл
		ПараметрыОтбора.НомерСтроки	= Запись.НомерСтроки;
		НайденныеСтроки	= Объект.Начисления.НайтиСтроки(ПараметрыОтбора);	
		Для каждого стр Из НайденныеСтроки Цикл
		    стр.Результат	= Запись.Результат;
		КонецЦикла; 
	КонецЦикла; 
	
	// ДопНачисления
	НаборЗаписейДоп	= РегистрыРасчета.ДопНачисления.СоздатьНаборЗаписей();
	НаборЗаписейДоп.Отбор.Регистратор.Установить(Объект.Ссылка);
	НаборЗаписейДоп.Прочитать();
	
	ПараметрыОтбора	= Новый Структура("НомерСтроки",);
	
	Для каждого Запись Из НаборЗаписейДоп Цикл
		ПараметрыОтбора.НомерСтроки	= Запись.НомерСтроки;
		НайденныеСтроки	= Объект.ДопНачисления.НайтиСтроки(ПараметрыОтбора);	
		Для каждого стр Из НайденныеСтроки Цикл
		    стр.Результат	= Запись.Результат;
		КонецЦикла; 
	КонецЦикла; 
	
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	НаборЗаписейДоп.Очистить();
	НаборЗаписейДоп.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры

