// установка периода
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для каждого Запись Из Движения.ЖурналПроводок Цикл
		Запись.Период	= Дата;
	КонецЦикла; 
КонецПроцедуры

// пометка удаления
Процедура ПриЗаписи(Отказ)
	НаборЗаписей	= РегистрыБухгалтерии.ЖурналПроводок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.УстановитьАктивность(НЕ ПометкаУдаления);
	НаборЗаписей.Записать();
КонецПроцедуры

// копирование
Процедура ПриКопировании(ОбъектКопирования)
	ОбъектКопирования.Движения.ЖурналПроводок.Прочитать();	
	Движения.ЖурналПроводок.Загрузить(ОбъектКопирования.Движения.ЖурналПроводок.Выгрузить());
	Движения.ЖурналПроводок.УстановитьАктивность(НЕ ПометкаУдаления);
КонецПроцедуры



