Процедура ОбновитьКартуМаршрута()
	
	КартаМаршрута	= РеквизитФормыВЗначение("Объект").ПолучитьКартуМаршрута();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьКартуМаршрута();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьКартуМаршрута();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Задача выполнена" Тогда
		Прочитать();
		ОбновитьКартуМаршрута();
	КонецЕсли; 
КонецПроцедуры

