Процедура РассчитатьНачисления(Регистратор) Экспорт
	// Оплата по часам
	НаборЗаписей	= РегистрыРасчета.НачисленияСотрудникам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);	
	НаборЗаписей.Прочитать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияСотрудникамДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	НачисленияСотрудникамДанныеГрафика.ЧасовФактическийПериодДействия КАК ЧасовФакт,
		|	НачисленияСотрудникамДанныеГрафика.ДнейФактическийПериодДействия КАК ДнейФакт
		|ИЗ
		|	РегистрРасчета.НачисленияСотрудникам.ДанныеГрафика(
		|			Регистратор = &Регистратор
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И ВидРасчета = &ВидРасчетаОплатаПоЧасам) КАК НачисленияСотрудникамДанныеГрафика
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ВидРасчетаОплатаПоЧасам", ПланыВидовРасчета.ОсновныеНачисления.ОкладПоЧасам);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Регистратор.Дата));
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка	= РезультатЗапроса.Выбрать();
		СтруктураПоиска	= Новый Структура("НомерСтроки",);
		Для каждого Запись Из НаборЗаписей Цикл
			СтруктураПоиска.НомерСтроки	= Запись.НомерСтроки;
			Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
				Если Запись.Сторно Тогда
					Запись.Результат	= -Запись.Параметр * Выборка.ЧасовФакт;			
					Запись.РабочихДней	= -Выборка.ДнейФакт;	
				Иначе					
					Запись.Результат	= Запись.Параметр * Выборка.ЧасовФакт;			
					Запись.РабочихДней	= Выборка.ДнейФакт;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать(, Истина);	
	КонецЕсли;
	
	// Компенсация за обед
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияСотрудникамДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(НачисленияСотрудникамДанныеГрафика.ДнейФактическийПериодДействия, 0) КАК ДнейФакт,
		|	ЕСТЬNULL(НачисленияСотрудникамДанныеГрафика.ДнейПериодРегистрации, 0) КАК ДнейПлан,
		|	ЕСТЬNULL(НачисленияСотрудникамБазаНачисленияСотрудникам.РезультатБаза, 0) КАК База
		|ИЗ
		|	РегистрРасчета.НачисленияСотрудникам.ДанныеГрафика(
		|			Регистратор = &Регистратор
//		|				И ПериодРегистрации = &ПериодРегистрации
		|				И ВидРасчета = &ВидРасчетаКомпенсация) КАК НачисленияСотрудникамДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.НачисленияСотрудникам.БазаНачисленияСотрудникам(
		|				&ИзмеренияРегистра,
		|				&ИзмеренияРегистра,
		|				,
		|				Регистратор = &Регистратор
//		|					И ПериодРегистрации = &ПериодРегистрации
		|					И ВидРасчета = &ВидРасчетаКомпенсация) КАК НачисленияСотрудникамБазаНачисленияСотрудникам
		|		ПО НачисленияСотрудникамДанныеГрафика.НомерСтроки = НачисленияСотрудникамБазаНачисленияСотрудникам.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	ИзмеренияРегистра		= Новый Массив(2);
	ИзмеренияРегистра[0]	= "Сотрудник";
	ИзмеренияРегистра[1]	= "Подразделение";
	
	Запрос.УстановитьПараметр("ИзмеренияРегистра", ИзмеренияРегистра);
	Запрос.УстановитьПараметр("ВидРасчетаКомпенсация", ПланыВидовРасчета.ОсновныеНачисления.КомпенсацияЗаОбед);
//	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(Регистратор.Дата));
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка	= РезультатЗапроса.Выбрать();
		СтруктураПоиска	= Новый Структура("НомерСтроки",);
		Для каждого Запись Из НаборЗаписей Цикл
			СтруктураПоиска.НомерСтроки	= Запись.НомерСтроки;
			Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда         
				//Если Запись.Сторно Тогда
				//	Запись.Результат	= -?(Выборка.ДнейПлан=0, 0, Выборка.ДнейФакт * 0.05 * Выборка.База / Выборка.ДнейПлан);		
				//	Запись.ДнейКомпенсации	= -Выборка.ДнейФакт; 
				//Иначе
				//	Запись.Результат	= ?(Выборка.ДнейПлан=0, 0, Выборка.ДнейФакт * 0.05 * Выборка.База / Выборка.ДнейПлан);		
				//	Запись.ДнейКомпенсации	= Выборка.ДнейФакт; 
				//КонецЕсли;
				
				// проблема с периодом регистратрации - не будем сторнировать компенсацию и убрали у КомпенсацияЗаОбед вытеснение Невыходо
				Запись.Результат	= ?(Выборка.ДнейПлан=0, 0, Выборка.ДнейФакт * 0.05 * Выборка.База / Выборка.ДнейПлан);		
				Запись.ДнейКомпенсации	= Выборка.ДнейФакт; 
			КонецЕсли;              
		КонецЦикла;
		НаборЗаписей.Записать(, Истина);	
	КонецЕсли;

КонецПроцедуры
