Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, РабочийДень, График) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.График.Установить(График);
	Набор.Прочитать();
	Набор.Очистить();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	//Для к = 0 По Набор.Количество()-1 Цикл
	//	
	//	Запись = Набор[к];
	//	Если Запись.Дата < ДатаНачала Тогда
	//	    Продолжить;
	//	ИначеЕсли Запись.Дата =Дат Тогда
	//		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
	//			Запись.Значение = 0;
	//		Иначе	          
	//			Запись.Значение = 24;
	//		КонецЕсли;
	//		Дат = Дат + ЧислоСекундВСутках;
	//	Иначе
	//		Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
	//			НоваяЗапись = Набор.Добавить();
	//			НоваяЗапись.График	= График;
	//			НоваяЗапись.Дата = Дат;
	//			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
	//				НоваяЗапись.Значение = 0;
	//			Иначе	          
	//				НоваяЗапись.Значение = 24;
	//			КонецЕсли; 
	//			Дат = Дат + ЧислоСекундВСутках;
	//		КонецЦикла; 
	//		Если Запись.Дата > ДатаОкончания Тогда
	//			Прервать;
	//		Иначе
	//			Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
	//				Запись.Значение = 0;
	//			Иначе	          
	//				Запись.Значение = 24;
	//			КонецЕсли;
	//		КонецЕсли;
	//		Дат = Дат + ЧислоСекундВСутках;
	//	КонецЕсли; 
	//КонецЦикла;
	//Набор.Записать();
	
	СчетчикДней	= 1;
	Пока Дат <= ДатаОкончания Цикл
		Если СчетчикДней > 3 Тогда
			СчетчикДней	= 1;		
		КонецЕсли;
		
		Запись = Набор.Добавить();
		Запись.График	= График;
		Запись.Дата = Дат;
		Если СчетчикДней = РабочийДень Тогда
			Запись.Значение = 24;
		Иначе	          
			Запись.Значение = 0;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
		СчетчикДней	= СчетчикДней + 1;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
