&НаКлиенте
Процедура РассчитатьСуммуПоТовару(стр)
	Если ЭтоУслуга(стр.Номенклатура) Тогда
		стр.Сумма	= стр.Цена;
	Иначе	
		стр.Сумма	= стр.Цена * стр.Количество;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровИУслугЦенаПриИзменении(Элемент)
	РассчитатьСуммуПоТовару(ТекущийЭлемент.ТекущиеДанные);	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровИУслугКоличествоПриИзменении(Элемент)
	РассчитатьСуммуПоТовару(ТекущийЭлемент.ТекущиеДанные);	
КонецПроцедуры

&НаСервере
Функция ЭтоУслуга(Номенклатура)

	Возврат Номенклатура.Услуга;

КонецФункции // ЭтоУслуга()

