
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДанныеТабеля 
	Движения.ДанныеТабеля.Записывать = Истина;
	Движения.ДанныеТабеля.Записать();
	
	Для Каждого стр Из СписокСотрудников Цикл
		ТекДата	= ПериодС;
		Для НомерДня = 1 По 7 Цикл
			ДанныеДня	= стр["Д"+СокрЛП(НомерДня)];
			Если ДанныеДня Тогда 
				Движение = Движения.ДанныеТабеля.Добавить();
				Движение.Период = ТекДата;
				Движение.Сотрудник = стр.Сотрудник;
				Движение.Подразделение = стр.Подразделение;
				Движение.ОтработаноДней = 1;
			КонецЕсли;			
			ТекДата	= ТекДата + 86400;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
