
Процедура ОбработкаПроведения(Отказ, Режим)
	НачМес	= НачалоМесяца(Дата);
	
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Движения.ОсновныеНачисления.Записать();
	Для Каждого стр Из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, стр);
		Движение.ПериодРегистрации = НачМес;
		Движение.ПериодДействияНачало = стр.ДатаНачала;
		Движение.ПериодДействияКонец = стр.ДатаОкончания;
	КонецЦикла;

	// регистр ДопНачисления
	Движения.ДопНачисления.Записывать = Истина;
	Движения.ДопНачисления.Записать();
	Для Каждого стр Из ДопНачисления Цикл
		Движение = Движения.ДопНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, стр);
		Движение.ПериодРегистрации = НачМес;
		Движение.БазовыйПериодНачало = НачМес;
		Движение.БазовыйПериодКонец = КонецМесяца(НачМес);
	КонецЦикла;

	Движения.Записать();
	
	Расчет.Рассчитать(Ссылка, НачМес);
	
КонецПроцедуры
