
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.УФ И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
//		УстановитьСоответствиеОбъектаИРеквизитаФормы(ТекущийОбъект, "Объект");    // Установка соответствия
//		ДействиеСОбъектом(ТекущийОбъект, Отказ);    // Действия над объектом, в процессе работы которых может возникнуть необходимость вывода сообщений
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЧ ИЗ &ТаблицаДанных КАК ТЧ";
		Запрос.УстановитьПараметр("ТаблицаДанных", ТекущийОбъект.ТоварыИУслуги.Выгрузить());
		Запрос.Выполнить();

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЧ.Номенклатура КАК Номенклатура,
			|	ТЧ.Количество КАК Количество,
			|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
			|	ПРЕДСТАВЛЕНИЕ(ТЧ.Номенклатура) КАК НоменклатураПредставление,
			|	ТЧ.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	ТЧ КАК ТЧ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
			|				&Дата,
			|				Номенклатура В
			|					(ВЫБРАТЬ
			|						ТЧ.Номенклатура
			|					ИЗ
			|						ТЧ КАК ТЧ)) КАК ОстаткиТоваровОстатки
			|		ПО ТЧ.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
			|ИТОГИ
			|	СУММА(Количество),
			|	МАКСИМУМ(КоличествоОстаток),
			|	МИНИМУМ(НомерСтроки)
			|ПО
			|	НоменклатураПредставление";
		
		Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНоменклатура.Следующий() Цикл
			Если ВыборкаНоменклатура.КоличествоОстаток < ВыборкаНоменклатура.Количество Тогда
			    Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст	= СтрШаблон("Не хватает %1 товара %2. В наличии есть только %3", СокрЛП(ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток), ВыборкаНоменклатура.НоменклатураПредставление, СокрЛП(ВыборкаНоменклатура.КоличествоОстаток));
				Сообщение.Поле	= "ТоварыИУслуги["+СокрЛП(ВыборкаНоменклатура.НомерСтроки - 1)+"].Количество";	
				
				// Привязка объекта к реквизиту формы произойдет за счет установленного выше по стеку соответствия методом УстановитьСоответствиеОбъектаИРеквизитаФормы
			    Сообщение.УстановитьДанные(ТекущийОбъект);
			    // Теперь у сообщения заполнено поле ПутьКДанным (установлено имя реквизита формы, до этого была пустая строка),
				// и свойство КлючДанных (установлена ссылка на документ, до этого было Неопределено)

			    Сообщение.Сообщить();
				Отказ	= Истина;
			КонецЕсли; 	
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

// не нужно - без этого все работает
&НаСервере
Процедура ДействиеСОбъектом(ОбъектДанных, Отказ)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЧ ИЗ &ТаблицаДанных КАК ТЧ";
	Запрос.УстановитьПараметр("ТаблицаДанных", ОбъектДанных.ТоварыИУслуги.Выгрузить());
	Запрос.Выполнить();

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Номенклатура КАК Номенклатура,
		|	ТЧ.Количество КАК Количество,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ПРЕДСТАВЛЕНИЕ(ТЧ.Номенклатура) КАК НоменклатураПредставление,
		|	ТЧ.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ТЧ КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&Дата,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ТЧ.Номенклатура
		|					ИЗ
		|						ТЧ КАК ТЧ)) КАК ОстаткиТоваровОстатки
		|		ПО ТЧ.Номенклатура = ОстаткиТоваровОстатки.Номенклатура
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(КоличествоОстаток),
		|	МИНИМУМ(НомерСтроки)
		|ПО
		|	НоменклатураПредставление";
	
	Запрос.УстановитьПараметр("Дата", ОбъектДанных.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.КоличествоОстаток < ВыборкаНоменклатура.Количество Тогда
		    Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст	= СтрШаблон("Не хватает %1 товара %2. В наличии есть только %3", СокрЛП(ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток), ВыборкаНоменклатура.НоменклатураПредставление, СокрЛП(ВыборкаНоменклатура.КоличествоОстаток));
			Сообщение.Поле	= "ТоварыИУслуги["+СокрЛП(ВыборкаНоменклатура.НомерСтроки - 1)+"].Количество";	
			
			// Привязка объекта к реквизиту формы произойдет за счет установленного выше по стеку соответствия методом УстановитьСоответствиеОбъектаИРеквизитаФормы
		    Сообщение.УстановитьДанные(ОбъектДанных);
		    // Теперь у сообщения заполнено поле ПутьКДанным (установлено имя реквизита формы, до этого была пустая строка),
			// и свойство КлючДанных (установлена ссылка на документ, до этого было Неопределено)

		    Сообщение.Сообщить();
			Отказ	= Истина;
		КонецЕсли; 	
		
	КонецЦикла;
	
КонецПроцедуры
