
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установка параметров динамического списка, переданных из формы документа "Расходная накладная"
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
	Список.Параметры.УстановитьЗначениеПараметра("ТипЦены", Параметры.ТипЦены);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	// Передача параметра структуры с данными в форму документа "Расходная накладная"
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("Номенклатура", Значение);
	СтруктураДанных.Вставить("Цена", ТекущаяСтрока.Цена);
	
	ОповеститьОВыборе(СтруктураДанных); // Приведет к вызову процедуры ОбработкаВыбора для таблицы СписокНоменклатуры вызвавшей формы
	
КонецПроцедуры
