
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ТекущийСотрудник		= Справочники.ФизическиеЛица.НайтиПоНаименованию(ИмяПользователя(), Истина);
	
	Если НЕ ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		НовыйСотрудник		= Справочники.ФизическиеЛица.СоздатьЭлемент();
		НовыйСотрудник.Код	= ИмяПользователя();
		НовыйСотрудник.Наименование	= ИмяПользователя(); 
		НовыйСотрудник.Записать();
		
		ТекущийСотрудник	= НовыйСотрудник.Ссылка;
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь	= ТекущийСотрудник;
	
	
КонецПроцедуры
