
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Задача выполнена" и Объект.Ссылка = Параметр Тогда
		Прочитать();		
		ОбновитьКартуМаршрута();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуМаршрута()
	КартаМаршрута = РеквизитФормыВЗначение("Объект").ПолучитьКартуМаршрута();  	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьКартуМаршрута();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьКартуМаршрута();
КонецПроцедуры
