
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ТекущийСотрудник				= Справочники.ФизическиеЛица.НайтиПоНаименованию(ИмяПользователя(), Истина);
	Если ТекущийСотрудник = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
		НовСотрудник				= Справочники.ФизическиеЛица.СоздатьЭлемент();
		НовСотрудник.Код			= ИмяПользователя();
		НовСотрудник.Наименование	= ИмяПользователя();
		НовСотрудник.Записать();
		
		ТекущийСотрудник			= НовСотрудник.Ссылка;
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийСотрудник= ТекущийСотрудник;
КонецПроцедуры
