
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Табель 
	Движения.Табель.Очистить();
	Движения.Табель.БлокироватьДляИзменения	= Истина;
	Движения.Табель.Записывать = Истина;
	
	НачалоМес	= НачалоМесяца(Дата);
	
	Для Каждого стрТЧ Из СписокСотрудников Цикл
		Для День=1 По 31 Цикл
			Если ЗначениеЗаполнено(стрТЧ["Д"+День]) Тогда
				Движение = Движения.Табель.Добавить();
				Движение.Период = НачалоМес + (День-1)*86400;
				Движение.Сотрудник = стрТЧ.Сотрудник;
				Движение.Подразделение = Подразделение;
				
				Если стрТЧ["Д"+День]="8" Тогда
					Движение.ЧасовОтработано = 8;
				ИначеЕсли стрТЧ["Д"+День]="8К" Тогда
					Движение.ЧасовКомандировка = 8;
				КонецЕсли;
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры
