Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, График, ДнейВСмене) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.График.Установить(График);
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	ДеньСмены	= 1;

	Дат = ДатаНачала;
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		Если Запись.Дата < ДатаНачала Тогда
		    Продолжить;
		ИначеЕсли Запись.Дата =Дат Тогда
			Если ДеньСмены > ДнейВСмене Тогда
				ДеньСмены	= 1;
			КонецЕсли;
			
			Если Найти(ВыходныеДни, Строка(ДеньСмены)) Тогда
				Запись.Часов = 0;
				Запись.Дней	= 0;
			Иначе	          
				Запись.Часов = 8;
				Запись.Дней	= 1;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
			ДеньСмены	= ДеньСмены + 1;
		Иначе
			Пока Дат < Мин(Запись.Дата, ДатаОкончания) Цикл
				Если ДеньСмены > ДнейВСмене Тогда
					ДеньСмены	= 1;
				КонецЕсли;
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.График	= График;
				НоваяЗапись.Дата = Дат;
				Если Найти(ВыходныеДни, Строка(ДеньСмены)) Тогда
					НоваяЗапись.Часов = 0;
					НоваяЗапись.Дней	= 0;	
				Иначе	          
					НоваяЗапись.Часов = 8;
					НоваяЗапись.Дней	= 1;	
				КонецЕсли; 
				Дат = Дат + ЧислоСекундВСутках;
				ДеньСмены	= ДеньСмены + 1;
			КонецЦикла; 
			Если ДеньСмены > ДнейВСмене Тогда
				ДеньСмены	= 1;
			КонецЕсли;
			Если Запись.Дата > ДатаОкончания Тогда
				Прервать;
			Иначе
				Если Найти(ВыходныеДни, Строка(ДеньСмены)) Тогда
					Запись.Часов = 0;
					Запись.Дней	= 0;
				Иначе	          
					Запись.Часов = 8;
					Запись.Дней	= 1;
				КонецЕсли;
			КонецЕсли;
			Дат = Дат + ЧислоСекундВСутках;
			ДеньСмены	= ДеньСмены + 1;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	ДеньСмены	= 1;
	Пока Дат <= ДатаОкончания Цикл
		Если ДеньСмены > ДнейВСмене Тогда
			ДеньСмены	= 1;
		КонецЕсли;
		Запись = Набор.Добавить();
		Запись.График	= График;
		Запись.Дата = Дат;
		Если Найти(ВыходныеДни, Строка(ДеньСмены)) Тогда
			Запись.Часов = 0;
			Запись.Дней	= 0;
		Иначе	          
			Запись.Часов = 8;
			Запись.Дней	= 1;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
		ДеньСмены	= ДеньСмены + 1;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры
