
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Начисления
	Движения.Начисления.Очистить();
	Движения.Начисления.Записывать = Истина;
	Для Каждого стр Из ОсновныеНачисления Цикл
		Движение = Движения.Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, стр);
		Движение.ПериодРегистрации			= НачалоМесяца(Дата);
		Движение.ПериодДействияКонец		= КонецДня(стр.ПериодДействияКонец);
		Если стр.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Сверхурочные Тогда
			Движение.БазовыйПериодНачало	= ДобавитьМесяц(НачалоМесяца(Дата), -1);
			Движение.БазовыйПериодКонец		= ДобавитьМесяц(КонецМесяца(Дата), -1);
		Иначе
			Движение.БазовыйПериодНачало	= стр.ПериодДействияНачало;
			Движение.БазовыйПериодКонец		= стр.ПериодДействияКонец;
		КонецЕсли;
	КонецЦикла;
	
	Движения.Записать();
	
	Расчет.РассчитатьНаисления(Ссылка);

КонецПроцедуры
