
Процедура ОбработкаПроведения(Отказ, Режим)
	ОбработкаПроведенияОУ(Отказ, Режим);
	
КонецПроцедуры

Процедура ОбработкаПроведенияОУ(Отказ, Режим)
	// регистр ОстаткиТовара Приход
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	Для Каждого ТекСтрокаТоварыУслуги Из ТоварыУслуги Цикл
		Движение = Движения.ОстаткиТовара.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТоварыУслуги.Номенклатура;
		Движение.Партия = Ссылка;
		Движение.Количество = ТекСтрокаТоварыУслуги.Количество;
		Движение.Сумма = ТекСтрокаТоварыУслуги.Сумма;
	КонецЦикла;

КонецПроцедуры
