
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Очистить();
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого стр Из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.ВидРасчета = стр.ВидРасчета;
		Движение.ПериодДействияНачало = стр.ДатаНачала;
		Движение.ПериодДействияКонец = стр.ДатаОкончания;
		Движение.ПериодРегистрации = стр.ДатаНачала;
		Движение.Сотрудник = стр.Сотрудник;
		Движение.Подразделение = стр.Подразделение;
	КонецЦикла;

	// регистр ДопНачисления
	Движения.ДопНачисления.Очистить();
	Движения.ДопНачисления.Записывать = Истина;
	Для Каждого стр Из ДопНачисления Цикл
		Движение = Движения.ДопНачисления.Добавить();
		Движение.ВидРасчета = стр.ВидРасчета;
		Движение.ПериодРегистрации = стр.ДатаНачала;
		Движение.Сотрудник = стр.Сотрудник;
		Движение.Подразделение = стр.Подразделение;
		Движение.Параметр = стр.ПроцентНадбавки;
	КонецЦикла;

	// регистр Удержания
	Движения.Удержания.Очистить();
	Движения.Удержания.Записывать = Истина;
	Для Каждого стр Из Удержания Цикл
		Движение = Движения.Удержания.Добавить();
		Движение.ВидРасчета = стр.ВидРасчета;
		Движение.ПериодРегистрации = стр.ДатаНачала;
		Движение.Сотрудник = стр.Сотрудник;
		Движение.Подразделение = стр.Подразделение;
		Движение.Параметр = Цел(стр.ВремяОпоздания / 15);
	КонецЦикла;
	
	Движения.Записать();
	
	Расчет.РассчитатьНачисленияУдержания(Ссылка);

КонецПроцедуры
