// копирование
Процедура ПриКопировании(ОбъектКопирования)
	ОбъектКопирования.Движения.ЖурналПроводок.Прочитать();
	Движения.ЖурналПроводок.Загрузить(ОбъектКопирования.Движения.ЖурналПроводок.Выгрузить());
	Движения.ЖурналПроводок.УстановитьАктивность(НЕ ПометкаУдаления);
	
КонецПроцедуры

// установка периода
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для каждого Движение Из Движения.ЖурналПроводок Цикл
		Движение.Период	= Дата;
	КонецЦикла;	
	
КонецПроцедуры

// Пометка удаления
Процедура ПриЗаписи(Отказ)
	НаборЗаписей		= РегистрыБухгалтерии.ЖурналПроводок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.УстановитьАктивность(НЕ ПометкаУдаления);
	НаборЗаписей.Записать();
	
КонецПроцедуры
